<a href="https://colab.research.google.com/github/samp3209/datamining/blob/main/moredatatransformations.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd
import numpy as np
import sklearn
from datetime import date

In [2]:
data = pd.read_csv('melb_data.csv')
#print(data.shape)
#print(data.info())

data['Date'] = pd.to_datetime(data['Date'])
#data.Date.head()
data.Propertycount = data.Propertycount.astype('int')

#building a map for data['Type']
TypeMap = {'h':'house', 'u': 'unit', 't':'town_house'}
data.Type.replace(TypeMap).sample(10)
data.Type = data.Type.astype('category')
#data.Type.memory_usage()
#data.Date.dt.month.sample(10)
data.Address.str.capitalize().sample(10)
data.Suburb

0           Abbotsford
1           Abbotsford
2           Abbotsford
3           Abbotsford
4           Abbotsford
             ...
13575    Wheelers Hill
13576     Williamstown
13577     Williamstown
13578     Williamstown
13579       Yarraville
Name: Suburb, Length: 13580, dtype: object

In [10]:
data = pd.read_csv('marketing_data.csv')
data['Age'] = date.today().year - data.Year_Birth
data.Age
data['Year'] = pd.DatetimeIndex(data.Dt_Customer).year
data.Year
data['Enrollment_Length'] = date.today().year - data.Year
data.Enrollment_Length
data.sample(10)
#replace ,$ and . 
data['Income'] = data[' Income '].str.replace(',', '').str.replace('$', '').str.replace('.', '').fillna(0).astype(int)
print(data.Income)
#lambda function is a small function call this one takes the income and scales it down to two digits
data['Income_ms'] = data['Income'].apply(lambda x: round(x/1000000, 2))
data[['Income','Income_ms']].describe()

0       8483500
1       5709100
2       6726700
3       3247400
4       2147400
         ...
2235    6647600
2236    3105600
2237    4631000
2238    6581900
2239    9487100
Name: Income, Length: 2240, dtype: int64

             Income    Income_ms
count  2.240000e+03  2240.000000
mean   5.168746e+06     5.168737
std    2.560934e+06     2.560927
min    0.000000e+00     0.000000
25%    3.472200e+06     3.470000
50%    5.107500e+06     5.105000
75%    6.828975e+06     6.830000
max    6.666660e+07    66.670000